{"inkVersion":20,"root":[[{"#":"image: blinking.gif"},{"#":"class: blinking"},{"#":"time: 7:45 PM"},{"->":"graduationParty"},["done",{"#n":"g-0"}],null],"done",{"graduationParty":[["^The ride to your secret spot has never been an easy one, and though it was made easier when you and Heather decided to spend the better part of a summer turning your path of convenience into something that resembled a real road, you still feel every remaining rock and hole as you make your way down it. The sun setting directly in front of you doesn’t help, but at least the radio tower starts to block it out the closer you get.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^You’re the first to show up. Heather had called before you left the house to let you know she’d be late, but for her, that usually meant she just wouldn’t be early.","\n","^You shut off the engine. You don’t need another lecture from your dad about taking care of his truck by running out the battery again.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[["ev",{"^->":"graduationParty.0.g-0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^You feel anxious without Heather here. ","<>",{"->":"$r","var":true},null]}],["ev",{"^->":"graduationParty.0.g-0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^You’re glad for the chance to be alone. ","<>",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"graduationParty.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"anxiousTruck"},{"#f":5}],"c-2":["ev",{"^->":"graduationParty.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"vibeOutside"},{"#f":5}]}]}],null],"anxiousTruck":[["^This is <i>her</i> secret spot, really, and it has never felt right to be here without her. When she gets here, then you’ll truly be able to appreciate your last night by the tower.","\n","^You roll down the window of the truck, glad for the breeze heralding the cooler night fast approaching.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"heatherArrives"},{"#f":5}]}],{"#f":1}],"vibeOutside":[["^Tonight is your final hurrah, and you’re glad for the chance to say goodbye to this place that has meant so much to you for all these years.","\n","^You grab your blanket as you hop out of the truck, set up in your usual spot, and wait.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"heatherArrives"},{"#f":5}]}],{"#f":1}],"heatherArrives":[[{"#":"CLEAR"},{"#":"image: blinking.gif"},{"#":"class: blinking"},{"#":"time: 8:00 PM"},"^Eventually, you hear the tell-tale rumbling of Heather’s mom’s car in the distance, and ","ev",{"CNT?":"anxiousTruck"},"/ev",[{"->":".^.b","c":true},{"b":["^hop out of the truck to meet her.",{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^sit up and wave as she approaches.",{"->":".^.^.^.10"},null]}],"nop","\n","^She parks her car near yours, angling it toward the circle of flattened grass for optimal headlight efficiency when the sun fully sets.","\n","ev",{"CNT?":"anxiousTruck"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^“Did you just get here?” she asks as she drags a large bag loaded down with snacks and who knows what else out of the car with her.","\n","^You shrug. “Something like that.”","\n","^She drops off her load near your usual spot. ","<>","\n",{"->":".^.^.^.19"},null]}],[{"->":".^.b"},{"b":["\n","^She has a large bag full of snacks and who knows what else that she drops down in front of you, then digs through it and pulls out her own blanket and sets it out. “Been waiting long?” she asks, a hint of guilt in her voice.","\n","^“Nah. Just taking in the evening air.”","\n","^Heather smiles. “Couldn’t have asked for better weather.” She glances back at your truck. ","<>","\n",{"->":".^.^.^.19"},null]}],"nop","\n","^“Did you bring the cooler?”","\n","^You nod, ","ev",{"CNT?":"vibeOutside"},"/ev",[{"->":".^.b","c":true},{"b":["^and accept her hand to help yank you up off the ground, ",{"->":".^.^.^.28"},null]}],"nop","^then head to the back of the truck, lower the tailgate, and the two of you haul the heavy cooler over to the bag of snacks.","\n","ev",{"CNT?":"vibeOutside"},"/ev",[{"->":".^.b","c":true},{"b":["^You sit back down on your blanket",{"->":".^.^.^.36"},null]}],[{"->":".^.b"},{"b":["^You perch on the cooler",{"->":".^.^.^.36"},null]}],"nop","^, and Heather lounges back on ","ev",{"CNT?":"vibeOutside"},"/ev",[{"->":".^.b","c":true},{"b":["^her own",{"->":".^.^.^.43"},null]}],[{"->":".^.b"},{"b":["^her blanket",{"->":".^.^.^.43"},null]}],"nop","^ next to you.","\n","^“Do you remember our first time out here?” she asks.","\n","^You nod. It was years ago, back in grade school, but you still remember it like it was yesterday.","\n",["ev",{"^->":"heatherArrives.0.50.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^You had just moved to town.",{"->":"$r","var":true},null]}],["ev",{"^->":"heatherArrives.0.51.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^You had just broken your arm.",{"->":"$r","var":true},null]}],["ev",{"^->":"heatherArrives.0.52.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^You were paired up for a project.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"heatherArrives.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.50.s"},[{"#n":"$r2"}],"\n",{"->":"transferStudent"},{"#f":5}],"c-1":["ev",{"^->":"heatherArrives.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.51.s"},[{"#n":"$r2"}],"\n",{"->":"brokenArm"},{"#f":5}],"c-2":["ev",{"^->":"heatherArrives.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.52.s"},[{"#n":"$r2"}],"\n",{"->":"projectPartners"},{"#f":5}]}],null],"transferStudent":[["^“I was the new kid. There were only, what, five other kids in the whole elementary school who hadn’t grown up here?”","\n","^Heather nods. “Not many people willingly move to a place that doesn’t even have a Walmart.”","\n","^“Or Starbucks. But nowhere else has Joe’s Diner, either. Not that he’ll serve you anything but black coffee.”","\n","^Heather laughs. “He even offered it to us at ten years old when I took you there that first weekend you started school.”","\n","^“I’d never had it. Or anything more caffeinated than a cup of soda. I thought I was dying,” you say, still embarrassed at the memory.","\n","^“I felt so bad,” Heather says, equally embarrassed. “So I took you to the place that always calmed <i>me</i> down. Of course, you weren’t in a state to ride your bike, so we had to trudge through the field on foot.”","\n","^“My mom freaked when I got home. My first ever tick-check,” you say, wrinkling your nose.","\n","^“The first of many.”","\n","^“It was worth it, though,” you say.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"backToHeather"},{"#f":5}]}],{"#f":1}],"brokenArm":[["^“I broke my arm falling out of a tree.”","\n","^“Pretty cliche of you,” Heather teases.","\n","^You roll your eyes. “That’s what you said then, too. I thought you were making fun of me–”","\n","^“And you <i>immediately</i> started crying,” Heather adds with a laugh.","\n","^“<i>And</i> you felt so bad you asked if I wanted in on a secret.”","\n","^“Pure panic response. I spent the rest of the day trying to figure out how to get out of it. But you were determined.”","\n","^“I was determined,” you agree. “TV taught me sharing secrets was the foundation of friendship, and I wanted more friends.”","\n","^“And now you’re stuck with me,” Heather says proudly.","\n","^“After you convinced me you weren’t trying to kill me by taking me into a corn field. Did you know I had just watched Children of the Corn the previous weekend?”","\n","^Heather looks aghast. “You were ten! Your parents barely let you watch scary movies <i>now</i>.”","\n","^“I was feeling rebellious, and Walt never pays attention to who is renting what.”","\n","^“Until they’re late.”","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"backToHeather"},{"#f":5}]}],{"#f":1}],"projectPartners":["^“We were grouped together for that science project. I don’t think we had really talked before that,” you say.","\n","^“I think that was the first year we were in the same class. We didn’t even sit next to each other, but Mrs. Fletcher had us pull our partner out of a hat rather than us just grabbing our friends or the person sitting next to us.”","\n","^“She liked to do eclectic things like that. Like she wanted to teach at one of those schools where you’re taught outside and get graded in stickers, but had to teach here.”","\n","^Heather laughs. “It’s a good thing, too. Do you remember what we were assigned to do?”","\n","^“It was a report on the local ecosystem or something, right? Like we were supposed to research native plants or bugs or whatever? I just remember checking out some encyclopedias from the library.”","\n","^“I forgot about the encyclopedias,” Heather groans.","\n","^You ignore the interruption. “I thought we were going to do our work there, but you said you had a better place to work,” you say dryly.","\n","^“In fairness to past me, this is a better place.”","\n","^“Not for working. Do you remember what we turned in?”","\n","^“I <i>had</i> only remembered we had just grabbed some weeds and a baby ear of corn, but then you mentioned the encyclopedias…”","\n","^“You had just learned about pressing flowers, and we convinced ourselves that would be the best way to preserve the weeds until Monday.”","\n","^You both burst into laughter.","\n","^“I just remember the look on Mrs. Fletcher’s face when we turned it in,” you say once your laughter calms down. “And then when our parents found out they’d have to split the bill in ordering a whole new set of encyclopedias, since the ones we used were out of print.”","\n","^“Still got a B, though,” Heather says.","\n","^“Still got a B,” you agree.","\n",{"->":"backToHeather"},{"#f":1}],"backToHeather":[["^You remember Heather finally coming out of the corn to the clearing around the radio tower that Heather had made. ","ev",{"CNT?":"transferStudent"},"/ev",[{"->":".^.b","c":true},{"b":["^You both had laid down to stare up at the sky, Heather pointing out shapes in the clouds until you eventually calmed down enough to join her.",{"->":".^.^.^.5"},null]}],"nop","ev",{"CNT?":"brokenArm"},"/ev",[{"->":".^.b","c":true},{"b":["^You regaled Heather with the tale of breaking your arm and the various hospital visits, while she looked appropriately intrigued and horrified.",{"->":".^.^.^.10"},null]}],"nop","ev",{"CNT?":"projectPartners"},"/ev",[{"->":".^.b","c":true},{"b":["^You both had started on track by looking up some flower names you remembered, before realizing you didn’t actually know the names of any of the flowers around you, and decided bringing examples of native plants made more sense, anyway.",{"->":".^.^.^.15"},null]}],"nop","^ By the time you left, Heather had to dig out flashlights and batteries she kept stashed under the tower so you both could find your ways home.","\n","^“It’s fitting to end where it started. Here.","ev",{"CNT?":"anxiousTruck"},"/ev",[{"->":".^.b","c":true},{"b":["^ With you.",{"->":".^.^.^.23"},null]}],"nop","^”","\n","^Heather just smiles.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"taylorArrives"},{"#f":5}]}],null],"taylorArrives":[[{"#":"clear"},{"#":"image: blinking.gif"},{"#":"class: blinking"},{"#":"time: 8:17 PM"},"^Taylor Arrives TODO","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"bobbyAndSamArrive"},{"#f":5}]}],null],"bobbyAndSamArrive":[[{"#":"clear"},{"#":"image: blinking.gif"},{"#":"class: blinking"},{"#":"time: 8:39 PM"},"^The sun’s almost gone. It gets darker out here than it does in town, and when you look up you see the red light on the tower is already on.","\n","^When you look back down, another truck, much nicer than your dad’s, is pulling up to the clearing. The driver does a 3-point turn as gracefully as you’ve ever seen and backs up next to Heather’s car. Two people get out and start walking your way. They’re being much louder than the vibe, if you’re honest.","\n","^“Ha! What?! They’ve got the whole band now?” yells a voice you know well.","\n","^“Yeah. You gotta check it out. You should come over and play some time. My sister doesn’t wanna play with me.”","\n","^Sam is finally here, and to your surprise, he’s brought Bobby with him.","\n","^You and Sam go way back.","\n",["ev",{"^->":"bobbyAndSamArrive.0.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^TODO backstory ",{"->":"$r","var":true},null]}],["ev",{"^->":"bobbyAndSamArrive.0.17.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^TODO backstory ",{"->":"$r","var":true},null]}],["ev",{"^->":"bobbyAndSamArrive.0.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^… ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"bobbyAndSamArrive.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],{"->":"samChoice1"},"\n",{"#f":5}],"c-1":["ev",{"^->":"bobbyAndSamArrive.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.17.s"},[{"#n":"$r2"}],{"->":"samChoice2"},"\n",{"#f":5}],"c-2":["ev",{"^->":"bobbyAndSamArrive.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.18.s"},[{"#n":"$r2"}],{"->":"bobbyIntro"},"\n",{"#f":5}]}],null],"samChoice1":[{"->":"bobbyIntro"},null],"samChoice2":[{"->":"bobbyIntro"},null],"bobbyIntro":[["^Bobby, on the other hand, is new. At least to this group.","\n","^“Hey,” he says, looking directly at you in a way that’s kind of intimidating. “Got any more blankets?”","\n",["ev",{"^->":"bobbyIntro.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^.”","/str",{"CNT?":"vibeOutside"},"/ev",{"*":".^.^.c-0","flg":23},{"s":["^“Yeah, sure. We can make room",{"->":"$r","var":true},null]}],["ev",{"^->":"bobbyIntro.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^.”","/str","/ev",{"*":".^.^.c-1","flg":22},{"s":["^“Uh…Sorry. I would’ve brought more",{"->":"$r","var":true},null]}],"ev","str","^You pretend not to hear him.","/str",{"CNT?":"anxiousTruck"},"/ev",{"*":".^.c-2","flg":21},{"c-0":["ev",{"^->":"bobbyIntro.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"^,” you say.","\n",{"->":"bobbyBlanket"},{"#f":5}],"c-1":["ev",{"^->":"bobbyIntro.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"^,” you say.","\n",{"->":"bobbyTailgate"},{"#f":5}],"c-2":["\n",{"->":"bobbyIgnore"},{"#f":5}]}],null],"bobbyTailgate":["^“That’s alright. Got a seat right here.”","\n","^Bobby lets his tailgate down and hops up on the bed, putting his backpack behind him. He invites Sam to sit next to him.","\n",{"->":"backToBobby"},null],"bobbyBlanket":["^“Oh, thanks,” he says, setting a backpack down on the ground. Sam and Bobby join you on the blankets.","\n",{"->":"backToBobby"},null],"bobbyIgnore":["^You don’t know what to say, so you do your best to act like you didn’t hear him.","\n","^“We’ll make room for you, Bobby,” says Heather, who knows exactly what you're doing. “Glad you made it.”","\n","^Taylor and Heather scoot closer to the radio tower, and Sam and Bobby sit down on their blankets. Taylor’s blanket is kind of small, you think. Sam might as well be sitting in the grass.","\n",{"->":"backToBobby"},null],"backToBobby":[[["ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},["ev",{"^->":"backToBobby.0.g-0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^He’s the captain of the basketball team.",{"->":"$r","var":true},null]}],"ev","str","^He used to date Liz Brown.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^His parents own half the town.","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n","^You don’t know Bobby that well. You <i>know</i> him, obviously.","\n",{"#f":5}],"c-1":["ev",{"^->":"backToBobby.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"bobbyBasketball"},{"#f":5}],"c-2":["\n",{"->":"bobbyGirlfriend"},{"#f":5}],"c-3":["\n",{"->":"bobbyRich"},{"#f":5}],"#n":"g-0"}],null],null],"bobbyBasketball":["<>","^ You heard he's got a scholarship at some fancy school with a famous coach. Until Sam started inviting him to lunch, you mostly saw Bobby's name in the paper your dad reads every morning.","\n","^Bobby put your town on the map as far as basketball goes. Until he joined the team, your high school had never even been group champion, much less state. You didn't really know what that meant, honestly, but it's all any of the parents could talk about the whole time you were in high school.","\n","^Despite the stereotype of the team captain, Bobby seems fine. Even nice, maybe.","\n",{"->":"everyonesHere"},null],"bobbyGirlfriend":["^Until recently, Bobby was dating Liz Brown, who's the kind of girl who doesn't belong in this town. She is extremely confident and has a huge personality, and in this town that makes you popular.","\n","^You and Liz were close back in elementary school, and you just grew apart over the years. She is still nice to you, but you don't really have anything in common any more. Until Sam started hanging out with him the last few months, you kind of felt the same way about Bobby.","\n","^Bobby and Liz had been together since Sophomore year, and everyone was surprised when they broke up. No one knew why though.","\n","^Sam started inviting Bobby to sit with you at lunch every once in a while a few months back. They mostly talked about guitars, both real ones and plastic ones. Bobby and Sam are both into the same kind of music, the stuff your dad listens to, and the only other time you've hung out with Bobby outside of school was when you all went over to Sam's place to play Guitar Hero.","\n",{"->":"everyonesHere"},null],"bobbyRich":["^Bobby's family is rich. Like <i>rich</i> rich. You don't really know what they do, but it's something about real estate.","\n","^The truck Bobby drove up in, the nice one? That's <i>his</i>, not his parents. Bobby is always missing random Fridays because his family has to fly to places like New York and LA for the weekend. You wonder why they live in a place like this.","\n","^In any other town, Bobby’s not the kind of guy you’d spend any time with, but this town is too small to avoid people for a reason like that. He and Sam have been hanging out a lot the last few months, and you even kind of enjoy his company sometimes.","\n",{"->":"everyonesHere"},null],"everyonesHere":[[["end",{"#n":"g-0"}],null],null]}],"listDefs":{}}